<a href="https://colab.research.google.com/github/jimmy-io/worksheeets-/blob/master/05_Merge_Housing_Market_Exercises_with_solutions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [2]:
##Step 2. Create 3 differents Series, each of length 100, as follows:
##The first a random number from 1 to 4
##The second a random number from 1 to 3
##The third a random number from 10,000 to 30,000
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

print(s1, s2, s3)

0     3
1     2
2     4
3     4
4     3
     ..
95    2
96    3
97    3
98    1
99    2
Length: 100, dtype: int64 0     2
1     2
2     2
3     3
4     3
     ..
95    2
96    1
97    2
98    2
99    3
Length: 100, dtype: int64 0     23365
1     20330
2     21953
3     17006
4     24503
      ...
95    29843
96    29586
97    29238
98    16056
99    24845
Length: 100, dtype: int64

In [0]:
data = pd.concat([s1,s2,s3], axis = 1)

In [4]:
data.head()

   0  1      2
0  3  2  23365
1  2  2  20330
2  4  2  21953
3  4  3  17006
4  3  3  24503

In [5]:
## Change the name of the columns to bedrs, bathrs, price_sqr_meter

data.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price'}, inplace = True )
data.head()

   bedrs  bathrs  price
0      3       2  23365
1      2       2  20330
2      4       2  21953
3      4       3  17006
4      3       3  24503

In [11]:
## Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

data2 = pd.concat([s1,s2,s3]).to_frame()
data2

        0
0       3
1       2
2       4
3       4
4       3
..    ...
95  29843
96  29586
97  29238
98  16056
99  24845

[300 rows x 1 columns]

In [12]:
##  Reindex the DataFrame so it goes from 0 to 299¶

data2.reset_index(drop = True, inplace = True)
data2.tail()

         0
295  29843
296  29586
297  29238
298  16056
299  24845